#!/usr/bin/python3
# coding=gbk
# -*- coding: utf-8 -*-
import re
import urllib.request
import urllib.parse
import time


def craw(chinese):
    url = 'http://hanyu.baidu.com/s?wd=' + urllib.parse.quote(chinese) + '&ptype=zici'

    header = {
       'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.119 Safari/537.36'
    }

    serverError = True
    while serverError:
        try:
            request = urllib.request.Request(url, headers=header)
            reponse = urllib.request.urlopen(request).read()
            html = str(reponse)

            imgs = re.compile('data-gif="(.+?\.gif)"').findall(html)
            for img in imgs:
                imagename = 'D:/汉字笔/' + chinese + '.gif'
                imageurl = img
                try:
                    urllib.request.urlretrieve(imageurl, filename=imagename)
                except:
                    print(chinese + ' failure')
            serverError = False
        except:
            print(chinese + 'server error')
            time.sleep(2)
strs = ['匕','刁','丐','歹','戈','夭','仑','讥','冗','邓','艾','夯','凸','卢','叭','叽','皿','凹','囚','矢','乍','尔','冯','玄','邦','迂','邢','芋','芍','吏','夷','吁','吕','吆','屹','廷','迄','臼','仲','伦','伊','肋','旭','匈','凫','妆','亥','汛','讳','讶','讹','讼','诀','弛','阱','驮','驯','纫','玖','玛','韧','抠','扼','汞','扳','抡','坎','坞','抑','拟','抒','芙','芜','苇','芥','芯','芭','杖','杉','巫','杈','甫','匣','轩','卤','肖','吱','吠','呕','呐','吟','呛','吻','吭','邑','囤','吮','岖','牡','佑','佃','伺','囱','肛','肘','甸','狈','鸠','彤','灸','刨','庇','吝','庐','闰','兑','灼','沐','沛','汰','沥','沦','汹','沧','沪','忱','诅','诈','罕','屁','坠','妓','姊','妒','纬','玫','卦','坷','坯','拓','坪','坤','拄','拧','拂','拙','拇','拗','茉','昔','苛','苫','苟','苞','茁','苔','枉','枢','枚','枫','杭','郁','矾','奈','奄','殴','歧','卓','昙','哎','咕','呵','咙','呻','咒','咆','咖','帕','账','贬','贮','氛','秉','岳','侠','侥','侣','侈','卑','刽','刹','肴','觅','忿','瓮','肮','肪','狞','庞','疟','疙','疚','卒','氓','炬','沽','沮','泣','泞','泌','沼','怔','怯','宠','宛','衩','祈','诡','帚','屉','弧','弥','陋','陌','函','姆','虱','叁','绅','驹','绊','绎','契','贰','玷','玲','珊','拭','拷','拱','挟','垢','垛','拯','荆','茸','茬','荚','茵','茴','荞','荠','荤','荧','荔','栈','柑','栅','柠','枷','勃','柬','砂','泵','砚','鸥','轴','韭','虐','昧','盹','咧','昵','昭','盅','勋','哆','咪','哟','幽','钙','钝','钠','钦','钧','钮','毡','氢','秕','俏','俄','俐','侯','徊','衍','胚','胧','胎','狰','饵','峦','奕','咨','飒','闺','闽','籽','娄','烁','炫','洼','柒','涎','洛','恃','恍','恬','恤','宦','诫','诬','祠','诲','屏','屎','逊','陨','姚','娜','蚤','骇','耘','耙','秦','匿','埂','捂','捍','袁','捌','挫','挚','捣','捅','埃','耿','聂','荸','莽','莱','莉','莹','莺','梆','栖','桦','栓','桅','桩','贾','酌','砸','砰','砾','殉','逞','哮','唠','哺','剔','蚌','蚜','畔','蚣','蚪','蚓','哩','圃','鸯','唁','哼','唆','峭','唧','峻','赂','赃','钾','铆','氨','秫','笆','俺','赁','倔','殷','耸','舀','豺','豹','颁','胯','胰','脐','脓','逛','卿','鸵','鸳','馁','凌','凄','衷','郭','斋','疹','紊','瓷','羔','烙','浦','涡','涣','涤','涧','涕','涩','悍','悯','窍','诺','诽','袒','谆','祟','恕','娩','骏','琐','麸','琉','琅','措','捺','捶','赦','埠','捻','掐','掂','掖','掷','掸','掺','勘','聊','娶','菱','菲','萎','菩','萤','乾','萧','萨','菇','彬','梗','梧','梭','曹','酝','酗','厢','硅','硕','奢','盔','匾','颅','彪','眶','晤','曼','晦','冕','啡','畦','趾','啃','蛆','蚯','蛉','蛀','唬','啰','唾','啤','啥','啸','崎','逻','崔','崩','婴','赊','铐','铛','铝','铡','铣','铭','矫','秸','秽','笙','笤','偎','傀','躯','兜','衅','徘','徙','舶','舷','舵','敛','翎','脯','逸','凰','猖','祭','烹','庶','庵','痊','阎','阐','眷','焊','焕','鸿','涯','淑','淌','淮','淆','渊','淫','淳','淤','淀','涮','涵','惦','悴','惋','寂','窒','谍','谐','裆','袱','祷','谒','谓','谚','尉','堕','隅','婉','颇','绰','绷','综','绽','缀','巢','琳','琢','琼','揍','堰','揩','揽','揖','彭','揣','搀','搓','壹','搔','葫','募','蒋','蒂','韩','棱','椰','焚','椎','棺','榔','椭','粟','棘','酣','酥','硝','硫','颊','雳','翘','凿','棠','晰','鼎','喳','遏','晾','畴','跋','跛','蛔','蜒','蛤','鹃','喻','啼','喧','嵌','赋','赎','赐','锉','锌','甥','掰','氮','氯','黍','筏','牍','粤','逾','腌','腋','腕','猩','猬','惫','敦','痘','痢','痪','竣','翔','奠','遂','焙','滞','湘','渤','渺','溃','溅','湃','愕','惶','寓','窖','窘','雇','谤','犀','隘','媒','媚','婿','缅','缆','缔','缕','骚','瑟','鹉','瑰','搪','聘','斟','靴','靶','蓖','蒿','蒲','蓉','楔','椿','楷','榄','楞','楣','酪','碘','硼','碉','辐','辑','频','睹','睦','瞄','嗜','嗦','暇','畸','跷','跺','蜈','蜗','蜕','蛹','嗅','嗡','嗤','署','蜀','幌','锚','锥','锨','锭','锰','稚','颓','筷','魁','衙','腻','腮','腺','鹏','肄','猿','颖','煞','雏','馍','馏','禀','痹','廓','痴','靖','誊','漓','溢','溯','溶','滓','溺','寞','窥','窟','寝','褂','裸','谬','媳','嫉','缚','缤','剿','赘','熬','赫','蔫','摹','蔓','蔗','蔼','熙','蔚','兢','榛','榕','酵','碟','碴','碱','碳','辕','辖','雌','墅','嘁','踊','蝉','嘀','幔','镀','舔','熏','箍','箕','箫','舆','僧','孵','瘩','瘟','彰','粹','漱','漩','漾','慷','寡','寥','谭','褐','褪','隧','嫡','缨','撵','撩','撮','撬','擒','墩','撰','鞍','蕊','蕴','樊','樟','橄','敷','豌','醇','磕','磅','碾','憋','嘶','嘲','嘹','蝠','蝎','蝌','蝗','蝙','嘿','幢','镊','镐','稽','篓','膘','鲤','鲫','褒','瘪','瘤','瘫','凛','澎','潭','潦','澳','潘','澈','澜','澄','憔','懊','憎','翩','褥','谴','鹤','憨','履','嬉','豫','缭','撼','擂','擅','蕾','薛','薇','擎','翰','噩','橱','橙','瓢','蟥','霍','霎','辙','冀','踱','蹂','蟆','螃','螟','噪','鹦','黔','穆','篡','篷','篙','篱','儒','膳','鲸','瘾','瘸','糙','燎','濒','憾','懈','窿','缰','壕','藐','檬','檐','檩','檀','礁','磷','瞭','瞬','瞳','瞪','曙','蹋','蟋','蟀','嚎','赡','镣','魏','簇','儡','徽','爵','朦','臊','鳄','糜','癌','懦','豁','臀','藕','藤','瞻','嚣','鳍','癞','瀑','襟','璧','戳','攒','孽','蘑','藻','鳖','蹭','蹬','簸','簿','蟹','靡','癣','羹','鬓','攘','蠕','巍','鳞','糯','譬','霹','躏','髓','蘸','镶','瓤','矗']
for st in strs:
    craw(st)
    time.sleep(2)